{
  "landing": {
    "title": "Hi, I'm David!",
    "subtitles": [
      "I am a software developer based in Hamilton, Canada. I graduated B.Sc Honours Mathematical Physics from the University of Waterloo with a minor in astrophysics and a minor in German.",
      "I am currently working as a programmer-analyst for Shared Services Canada, where I use Blazor, C# and Azure to develop a cloud-based analytics platform for Canadian scientists.",
      "Please feel free to contact me if you have any questions, or if you would like to chat!"
    ],
    "pictureName": "david.jpg",
    "signatureName": "signature.png",
    "socialMedia": [
      {
        "name": "LinkedIn",
        "url": "https://www.linkedin.com/in/david-ren%C3%A9-157696198/"
      },
      {
        "name": "GitHub",
        "url": "https://github.com/davidreneuw"
      },
      {
        "name": "Email",
        "url": "mailto:davrene11@gmail.com"
      }
    ]
  },
  "sections": [
    {
      "title": "Home",
      "id": "home",
      "contentType": "card",
      "contents": [""]
    },
    {
      "title": "About",
      "id": "about",
      "contents": [
        {
          "title": "Who am I?",
          "content": [
            "I am a passionate developer with a background in physics and mathematics. I am currently working as an IT-02 programmer-analyst for the federal government of Canada.",
            "I have reliability clearance."
          ],
          "contentType": "card",
          "tags": ["info"]
        },
        {
          "title": "Goals & Interests",
          "content": [
            "My focus is fully on improving. I am always exploring as many different technologies and frameworks in order to bring freshness to Canadian web services in my current role.",
            "I am fluent in English and French, and I am currently at the B2 level in German. Language learning has always been a passion of mine: I find discovering the intricate workings of a language fascinating and the ability it gives me to connect with others has always pushed me to learn more.",
            "You will also catch me reading books such as the Stormlight Archive series, playing saxophone, or playing video games such as Minecraft and Factorio"
          ],
          "contentType": "card",
          "tags": ["info"]
        },
        {
          "title": "Current work & used technologies",
          "content": [
            "I am currently working as a programmer-analyst for Shared Services Canada, where I use Blazor, C# and Azure to develop a cloud-based analytics platform for Canadian scientists.",
            "Here is a list of all the technologies I have used. You may click on them to filter the projects, experience and education that involves them:"
          ],
          "contentType": "card",
          "tags": ["info"]
        }
      ]
    },
    {
      "title": "Experience",
      "id": "experience",
      "contentType": "card",
      "contents": [
        {
          "title": "Programmer-analyst @ Shared Services Canada",
          "subtitle": "January 2022 - Present",
          "tags": [
            "info",
            "blazor",
            "dotnet",
            "azure",
            "mudblazor",
            "csharp",
            "css"
          ],
          "contentType": "dropcard",
          "content": [
            "Worked on a government-wide analytics platform for Canadian scientists using Blazor, C#, Azure and MudBlazor. I did full-stack work, from front-end UI design and edits to back-end API development and feature addition.",
            "Note: I was a co-op student full-time/part-time between January 2022 and May 2023, at which point I was bridged over as a full-time employee."
          ],
          "codeUrl": "https://github.com/ssc-sp/datahub-portal"
        },
        {
          "title": "Data Scientist Student @ Canadian Space Agency",
          "subtitle": "Jan 2021 - August 2021",
          "contentType": "dropcard",
          "content": [
            "Manage and provide an analysis of data collected by satellites SCISAT-1 and Alouette through a web application. Geographical analysis as well as chronological analysis."
          ],
          "tags": ["info", "python", "django", "css", "html"],
          "codeUrl": "https://github.com/asc-csa/Scisat-App",
          "url": "https://donnees-data.asc-csa.gc.ca:8888/scisat/"
        },
        {
          "title": "Geomagnetic Network Developer @ Natural Resources Canada",
          "subtitle": "Sept 2021 - Dec 2021",
          "contentType": "dropcard",
          "content": [
            "Maintain and develop a network used for the acquisition of data in a study of the effects of the Ottawa light rail train on the local geomagnetic field."
          ],
          "tags": ["info", "bash", "python", "linux"]
        },
        {
          "title": "Math Teaching Assistant @ University of Waterloo",
          "subtitle": "Sept 2020 - Dec 2020",
          "contentType": "dropcard",
          "content": [
            "Created solutions, answered student questions and assessed student performance for the courses MATH227: Calculus 3 for Honours Physics and MATH218: Differential Equations for Engineers."
          ],
          "tags": ["info"]
        },
        {
          "title": "Bioinformatics Research Assistant @ CAMH",
          "subtitle": "Jan 2020 - Apr 2020",
          "contentType": "dropcard",
          "content": [
            "Created a genetic algorithm to improve the structure of the paradigm used for data acquisition. Created a mobile application on Android that will allow better diagnosis and prescriptions for Schizophrenia patients."
          ],
          "tags": ["info", "python", "matlab"]
        }
      ]
    },
    {
      "title": "Projects",
      "id": "projects",
      "contentType": "card",
      "contents": [
        {
          "title": "This website!",
          "content": [
            "This website was built using React and TypeScript. It is hosted on Vercel.",
            "I built it and designed the front-end all myself without the use of a front-end framework. I built it and designed the front-end all myself without the use of a front-end framework."
          ],
          "contentType": "dropcard",
          "tags": ["info", "react", "typescript", "css", "vercel"],
          "codeUrl": "https://github.com/davidreneuw/website"
        }
      ]
    },
    {
      "title": "Education",
      "id": "education",
      "contentType": "card",
      "contents": [
        {
          "title": "B.Sc Honours Co-Op Mathematical Physics @ University of Waterloo",
          "subtitle": "Sept 2018 - Apr 2023",
          "contentType": "dropcard",
          "content": [
            "Specialization in applied mathematics, with a focus on numerical analysis, fluid dynamics, mathematical modelling and mathematics of climate change.",
            "Minor in Astrophysics and minor in German.",
            "I was also the Vice-President Finances of the Science student association for 2 terms."
          ],
          "tags": ["info", "python"]
        },
        {
          "title": "DEC Mathematics and Computer Science @ CÉGEP Limoilou",
          "subtitle": "Sept 2016 - Apr 2018",
          "contentType": "dropcard",
          "content": [
            "Completed a \"DEC\" (Diplôme d'études collégiales) in Mathematics and Computer Science. I was taught data structures, algorithms, object-oriented programming in Java, as well as a focus on agile development and project management.",
            "Also learned linear algebra, calculus, discrete mathematics, physics and philosophy at a university level."
          ],
          "tags": ["info", "java"]
        }
      ]
    },
    {
      "title": "Resume",
      "id": "resume",
      "contents": [
        {
          "title": "View my resume",
          "content": ["You may view my most recent resume here."],
          "contentType": "dropcard-resume",
          "tags": ["info"],
          "url": "./resume.pdf",
          "locked": true
        }
      ]
    },
    {
      "title": "Contact me",
      "id": "contact",
      "contents": [
        {
          "title": "If you would like to contact me...",
          "content": [
            "Please reach out to me on LinkedIn, GitHub or by email. You may find these links in the home section.",
            "You can also reach me at 5819864960"
          ],
          "contentType": "card",
          "tags": ["info"]
        }
      ]
    }
  ]
}
